coupled_simulation/fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (100 0 0); // O il valore di velocità desiderato
    }
    
    outlet
    {
        type            zeroGradient;
    }

    walls // Modificato da domainWalls
    {
        type            noSlip;
    }

    NASA
    {
        type            movingWallVelocity;
        value           uniform (0 0 0); // Velocità iniziale zero
    }
}