coupled_simulation/fluid-openfoam/0/phi
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    object      phi;
}

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    walls // Modificato da domainWalls
    {
        type            calculated;
        value           uniform 0;
    }

    NASA
    {
        type            calculated;
        value           uniform 0;
    }
}