coupled_simulation/fluid-openfoam/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver      displacementLaplacian;

displacementLaplacianCoeffs {
    diffusivity quadratic inverseDistance (NASA);
}
