coupled_simulation/fluid-openfoam/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;

// simulationType  RAS;

// RAS
// {
//     RASModel        kOmegaSST;
//     turbulence      on;
//     printCoeffs     on;
// }
